Тест/Тест/src/Catalogs/ТМЦВорктрак/ТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТМЦВорктрак</name>
  <attributes>
    <name>ВидИнвентаря</name>
    <type>
      <types>CatalogRef.ВидыИнвентаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БухКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Documents/ПоступлениеТМЦСкладСнабжение/ПоступлениеТМЦСкладСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТМЦСкладСнабжение</name>
  <basedOn>Document.ЗаявкаНаРасход</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеТМЦСкладСнабжение</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУПД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.СкладСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦПоНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчета</name>
      <type>
        <types>EnumRef.ТипУчетаТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/МестаХраненияТМЦ/МестаХраненияТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МестаХраненияТМЦ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписания</name>
    <type>
      <types>EnumRef.ВидыСписания</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ИнвентарныеНомера/ИнвентарныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнвентарныеНомера</name>
  <owners>Catalog.СкладСнабжение</owners>
  <owners>Catalog.ТМЦВорктрак</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
      <types>DocumentRef.ПоступлениеТМЦВорктрак</types>
      <types>DocumentRef.ПоступлениеТМЦ</types>
      <types>DocumentRef.ПоступлениеТМЦСкладСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнвентарногоНомераТМЦ</name>
    <type>
      <types>EnumRef.СтатусыИнвентарныхНомеровТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IMEI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ТМЦВорктрак/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ГомзМА 14.04.2023
	Список.Параметры.УстановитьЗначениеПараметра("Дата", 	ТекущаяДатаСеанса());
	Список.Параметры.УстановитьЗначениеПараметра("Группа", 	Справочники.МестаХраненияТМЦ.НайтиПоКоду("000000052"));
	///-ГомзМА 14.04.2023
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	///+ГомзМА 25.04.2023
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ТекДанные = Элементы.Список.ТекущаяСтрока;
		ИнвентарныеНомера.Параметры.УстановитьЗначениеПараметра("Владелец", ТекДанные);
	КонецЕсли;
	///-ГомзМА 25.04.2023
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура СоздатьПоступление(Команда)
	
	///+ГомзМА 26.04.2023
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Документ = СоздатьДокументПоступление(ТекДанные.Код);
	
	ПараметрыФормы = Новый Структура("Ключ", Документ);
	ОткрытьФорму("Документ.ПоступлениеТМЦСкладСнабжение.ФормаОбъекта", ПараметрыФормы);
	///-ГомзМА 26.04.2023
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПеремещение(Команда)
	
	///+ГомзМА 26.04.2023
	ТекДанные = Элементы.ИнвентарныеНомера.ТекущиеДанные;
	
	Документ = СоздатьДокументПеремещениеТМЦ(ТекДанные.Наименование);
	
	
	ПараметрыФормы = Новый Структура("Ключ", Документ);
	ОткрытьФорму("Документ.ПеремещениеТМЦ.ФормаОбъекта", ПараметрыФормы);
	///-ГомзМА 26.04.2023
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

	&НаСервере
Функция СоздатьДокументПоступление(Код);

	///+ГомзМА 26.04.2023
	НовыйДокумент 			 	= Документы.ПоступлениеТМЦСкладСнабжение.СоздатьДокумент();
	НовыйДокумент.Дата  	 	= ТекущаяДатаСеанса();
	НовыйДокумент.Склад 	 	= Справочники.МестаХраненияТМЦ.НайтиПоКоду("000000001");
	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	
	НовыйДокументТЧ 		 	= НовыйДокумент.СписокТМЦ.Добавить();
	НовыйДокументТЧ.ТМЦ 	 	= Справочники.СкладСнабжение.НайтиПоКоду(Код);
	НовыйДокументТЧ.Код 		= НовыйДокументТЧ.ТМЦ.Код;
	НовыйДокументТЧ.ТипУчета 	= Перечисления.ТипУчетаТМЦ.УчестьПоштучно;
	НовыйДокументТЧ.Склад 	 	= Справочники.МестаХраненияТМЦ.НайтиПоКоду("000000001");
	НовыйДокументТЧ.Количество 	= 1;
	
	НовыйДокумент.Записать();
	Возврат НовыйДокумент.Ссылка;
	///-ГомзМА 26.04.2023

КонецФункции // СоздатьДокументПоступление(Код);


&НаСервере
Функция СоздатьДокументПеремещениеТМЦ(Наименование);

	///+ГомзМА 26.04.2023
	НовыйДокумент 			 		= Документы.ПеремещениеТМЦ.СоздатьДокумент();
	НовыйДокумент.Дата  	 		= ТекущаяДатаСеанса();
	НовыйДокумент.Ответственный 	= Пользователи.ТекущийПользователь();
	
	НовыйДокументТЧ 		 		 = НовыйДокумент.СписокТМЦ.Добавить();
	НовыйДокументТЧ.ИнвентарныйНомер = Справочники.ИнвентарныеНомера.НайтиПоНаименованию(Наименование);
	НовыйДокументТЧ.ТМЦ 			 = НовыйДокументТЧ.ИнвентарныйНомер.Владелец;
	НовыйДокументТЧ.СерийныйНомер 	 = НовыйДокументТЧ.ИнвентарныйНомер.СерийныйНомер;
	НовыйДокументТЧ.Количество 	 	 = 1;
	НовыйДокументТЧ.Цена 			 = НовыйДокументТЧ.ИнвентарныйНомер.Стоимость;
	НовыйДокументТЧ.Сумма 			 = НовыйДокументТЧ.Количество * НовыйДокументТЧ.Цена;
	
	НовыйДокумент.Записать();
	Возврат НовыйДокумент.Ссылка;
	///-ГомзМА 26.04.2023

КонецФункции // СоздатьДокументПеремещениеТМЦ(Код);

&НаКлиенте
Процедура ИнвентарныеНомераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ГомзМА 12.05.2023
	ТекСтрока = Элементы.ИнвентарныеНомера.ТекущиеДанные;
	Если Поле = Элементы.ИнвентарныеНомераСсылка Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Ссылка;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Справочник.ИнвентарныеНомера.Форма.ФормаЭлемента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///+ГомзМА 12.05.2023
	
КонецПроцедуры


#КонецОбласти
